In [2]:
import pandas as pd

In [3]:
stock=pd.read_csv("E://Datasets//New Dataset//google_stock_price.csv",squeeze=True)
stock.head(10)

0    50.12
1    54.10
2    54.65
3    52.38
4    52.95
5    53.90
6    53.02
7    50.95
8    51.13
9    50.07
Name: Stock Price, dtype: float64

## idxmax(), .idxmin()

In [4]:
#idxmax() return maximum value of index.
stock.idxmax()

3011

In [5]:
#idxmax() return minimum value of index.
stock.idxmin()

11

In [10]:
pokemon=pd.read_csv("E://Datasets//New Dataset//pokemon_new.csv",squeeze=True)
print(pokemon.head(10))

      Pokemon   Type
0   Bulbasaur  Grass
1     Ivysaur  Grass
2    Venusaur  Grass
3  Charmander   Fire
4  Charmeleon   Fire
5   Charizard   Fire
6    Squirtle  Water
7   Wartortle  Water
8   Blastoise  Water
9    Caterpie    Bug

## value_counts Methods

In [12]:
#Count the number of category.
pokemon.count()

Pokemon    721
Type       721
dtype: int64

## .apply() Methods

In [13]:
def classify_data(number):
    if number<300:
        return "Good"
    elif number>500:
        return "Incredible"
    else:
        return "Satisfactory"

In [16]:
stock.apply(classify_data).tail(15)

2997    Incredible
2998    Incredible
2999    Incredible
3000    Incredible
3001    Incredible
3002    Incredible
3003    Incredible
3004    Incredible
3005    Incredible
3006    Incredible
3007    Incredible
3008    Incredible
3009    Incredible
3010    Incredible
3011    Incredible
Name: Stock Price, dtype: object

## Add New Column to Dataframe

In [32]:
pokemon=pd.read_csv("E://Datasets//New Dataset//pokemon_new.csv")
print(pokemon.head(10))

      Pokemon   Type
0   Bulbasaur  Grass
1     Ivysaur  Grass
2    Venusaur  Grass
3  Charmander   Fire
4  Charmeleon   Fire
5   Charizard   Fire
6    Squirtle  Water
7   Wartortle  Water
8   Blastoise  Water
9    Caterpie    Bug

In [33]:
pokemon['Channel']="Sony_TV"

In [34]:
pokemon

        Pokemon     Type  Channel
0     Bulbasaur    Grass  Sony_TV
1       Ivysaur    Grass  Sony_TV
2      Venusaur    Grass  Sony_TV
3    Charmander     Fire  Sony_TV
4    Charmeleon     Fire  Sony_TV
..          ...      ...      ...
716     Yveltal     Dark  Sony_TV
717     Zygarde   Dragon  Sony_TV
718     Diancie     Rock  Sony_TV
719       Hoopa  Psychic  Sony_TV
720   Volcanion     Fire  Sony_TV

[721 rows x 3 columns]

In [35]:
# if you want to add column in specific index then we used insert method.
pokemon.insert(1,column='Location',value='India')
pokemon

        Pokemon Location     Type  Channel
0     Bulbasaur    India    Grass  Sony_TV
1       Ivysaur    India    Grass  Sony_TV
2      Venusaur    India    Grass  Sony_TV
3    Charmander    India     Fire  Sony_TV
4    Charmeleon    India     Fire  Sony_TV
..          ...      ...      ...      ...
716     Yveltal    India     Dark  Sony_TV
717     Zygarde    India   Dragon  Sony_TV
718     Diancie    India     Rock  Sony_TV
719       Hoopa    India  Psychic  Sony_TV
720   Volcanion    India     Fire  Sony_TV

[721 rows x 4 columns]